================================================================================
Basic comments
================================================================================

<!-- This is a comment -->
Text outside comment
<!-- Multi-line
     comment that spans
     several lines -->
Text after multi-line comment

--------------------------------------------------------------------------------

(source_file
  (comment)
  (paragraph
    (text))
  (comment)
  (paragraph
    (text)))

================================================================================
Nested comments
================================================================================

<!-- Outer comment <!-- Nested comment --> still in outer comment -->
Text between comments
<!-- Another <!-- complex <!-- nesting --> example --> -->

--------------------------------------------------------------------------------

(source_file
  (comment)
  (paragraph
    (text))
  (comment))

================================================================================
Comments with special characters
================================================================================

<!-- Comment with * bold * markup -->
<!-- Comment with [[ links ]] -->
<!-- Comment with == headings == -->
<!-- Comment with {| table |} syntax -->

--------------------------------------------------------------------------------

(source_file
  (newline)
  (newline)
  (newline)
  (newline)
  (newline))

================================================================================
Comments within other elements
================================================================================

== Heading <!-- with comment --> ==
* List item <!-- comment in list -->
* Second item

Text paragraph <!-- inline comment --> with comment.

--------------------------------------------------------------------------------

(source_file
  (heading
    (h2
      (text)))
  (newline)
  (bullet_list
    (bl1
      (content
        (text)))
    (bl1
      (content
        (text))))
  (newline)
  (text)
  (newline))

================================================================================
Comments at file boundaries
================================================================================

<!-- Comment at the start -->
Text in middle
<!-- Comment at the end -->

--------------------------------------------------------------------------------

(source_file
  (newline)
  (newline)
  (text)
  (newline)
  (newline))

================================================================================
Comment-like syntax that isn't a comment
================================================================================

Text with < and > characters
Text with <!-- incomplete comment
Text with <!- not quite a comment ->

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text))
  (paragraph
    (text))
  (paragraph
    (text)))
