================================================================================
Basic table
================================================================================

{| 
|Cell 1
|Cell 2
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))))

================================================================================
Table with caption and headers
================================================================================

{|
|+ Table caption
! Header 1
! Header 2
| Cell 1
| Cell 2
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_caption
      (table_attributes
        (html_attribute
          (html_attribute_name))
        (html_attribute
          (html_attribute_name))))
    (colheaders
      (table_header_cell
        (table_header_cell_block
          (cell_marker)
          (text)
          (text))))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))))

================================================================================
Table with rows
================================================================================

{|
| Cell 1.1
| Cell 1.2
|-
| Cell 2.1
| Cell 2.2
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_row
      (table_cell
        (table_cell_block
          (cell_marker)
          (text)))
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))))

================================================================================
Table with attributes
================================================================================

{| class="wikitable"
| Cell 1
| style="color: red" | Cell 2
|-
| Cell 3
| Cell 4
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_attributes
      (html_attribute
        (html_attribute_name)
        (html_attribute_value)))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_row
      (table_cell
        (table_cell_block
          (cell_marker)
          (text)))
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))))

================================================================================
Table with formatting inside cells
================================================================================

{|
| '''Bold text'''
| ''Italic text''
|-
| [[Wikilink]]
| [http://example.com External link]
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_cell
      (table_cell_block
        (cell_marker)
        (text)))
    (table_row
      (table_cell
        (table_cell_block
          (cell_marker)
          (text)))
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))))

================================================================================
Table with row attributes
================================================================================

{|
|-
| Cell 1.1
|-class="highlight"
| Cell 2.1
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_row
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))
    (table_row
      (table_attributes
        (html_attribute
          (html_attribute_name)
          (html_attribute_value)))
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))))

=============================
Table with extra row starter
=============================

{|
|-
| Row 1 Cell 1
|-
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_row
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))))
