================================================================================
Basic table
================================================================================

{| 
|Cell 1
|Cell 2
|}

--------------------------------------------------------------------------------

(document
  (newline)
  (table
    (attribute)
    (tablecell
      (content
        (text)))
    (tablecell
      (content
        (text))))
  (newline))

================================================================================
Table with caption and headers
================================================================================

{|
|+ Table caption
! Header 1
! Header 2
| Cell 1
| Cell 2
|}

--------------------------------------------------------------------------------

(document
  (newline)
  (table
    (tablecaption
      (content
        (text)))
    (colheaders
      (tableheader
        (content
          (text)))
      (tableheader
        (content
          (text))))
    (tablecell
      (content
        (text)))
    (tablecell
      (content
        (text))))
  (newline))

================================================================================
Table with rows
================================================================================

{|
| Cell 1.1
| Cell 1.2
|-
| Cell 2.1
| Cell 2.2
|}

--------------------------------------------------------------------------------

(document
  (newline)
  (table
    (tablecell
      (content
        (text)))
    (tablecell
      (content
        (text)))
    (tablerow
      (tablecell
        (content
          (text)))
      (tablecell
        (content
          (text)))))
  (newline))

================================================================================
Table with attributes
================================================================================

{| class="wikitable"
| Cell 1
| style="color: red" | Cell 2
|-
| Cell 3
| Cell 4
|}

--------------------------------------------------------------------------------

(document
  (newline)
  (table
    (attribute)
    (tablecell
      (content
        (text)))
    (tablecell
      (attribute
        (text))
      (content
        (text)))
    (tablerow
      (tablecell
        (content
          (text)))
      (tablecell
        (content
          (text)))))
  (newline))

================================================================================
Table with formatting inside cells
================================================================================

{|
| '''Bold text'''
| ''Italic text''
|-
| [[Wikilink]]
| [http://example.com External link]
|}

--------------------------------------------------------------------------------

(document
  (newline)
  (table
    (tablecell
      (content
        (text)
        (bold
          (content
            (text)))))
    (tablecell
      (content
        (text)
        (italic
          (content
            (text)))))
    (tablerow
      (tablecell
        (content
          (text)
          (wikilink
            (target))))
      (tablecell
        (content
          (text)
          (external_link
            (target)
            (label
              (text)))))))
  (newline))

================================================================================
Nested tables
================================================================================

{|
|
{|
| Nested cell
|}
|
| Outer cell
|}

--------------------------------------------------------------------------------

(document
  (newline)
  (table
    (tablecell
      (content
        (newline)
        (table
          (tablecell
            (content
              (text))))))
    (tablecell
      (content
        (newline)
        (text))))
  (newline))

================================================================================
Table with row attributes
================================================================================

{|
|-
| Cell 1.1
|-class="highlight"
| Cell 2.1
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_row
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))
    (table_row
      (table_attributes
        (html_attribute
          (html_attribute_name)
          (html_attribute_value)))
      (table_cell
        (table_cell_block
          (cell_marker)
          (text))))))
