================================================================================
Basic table
================================================================================

{| 
|Cell 1
|Cell 2
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (tablecell
      (content
        (text)))
    (tablecell
      (content
        (text)))))

================================================================================
Table with caption and headers
================================================================================

{|
|+ Table caption
! Header 1
! Header 2
| Cell 1
| Cell 2
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (tablecaption
      (content
        (text)))
    (colheaders
      (tableheader
        (content
          (text)))
      (tableheader
        (content
          (text))))
    (tablecell
      (content
        (text)))
    (tablecell
      (content
        (text)))))

================================================================================
Table with rows
================================================================================

{|
| Cell 1.1
| Cell 1.2
|-
| Cell 2.1
| Cell 2.2
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (tablecell
      (content
        (text)))
    (tablecell
      (content
        (text)))
    (tablerow
      (tablecell
        (content
          (text)))
      (tablecell
        (content
          (text))))))

================================================================================
Table with attributes
================================================================================

{| class="wikitable"
| Cell 1
| Cell 2
|-
| Cell 3
| Cell 4
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (table_attribute
      (html_attribute
        (html_attribute_name)
        (html_attribute_value)))
    (tablecell
      (content
        (text)))
    (tablecell
      (content
        (text)))
    (tablerow
      (tablecell
        (content
          (text)))
      (tablecell
        (content
          (text))))))

================================================================================
Table with formatting inside cells
================================================================================

{|
| '''Bold text'''
| ''Italic text''
|-
| [[Wikilink]]
| [http://example.com External link]
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (tablecell
      (content
        (bold
          (text))))
    (tablecell
      (content
        (italic
          (text))))
    (tablerow
      (tablecell
        (content
          (wikilink
            (wikilink_page
              (page_name_segment)))))
      (tablecell
        (content
          (external_link
            (url)
            (page_name_segment)))))))

================================================================================
Table with row attributes
================================================================================

{|
|-
| Cell 1.1
|-class="highlight"
| Cell 2.1
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (tablerow
      (tablecell
        (content
          (text))))
    (tablerow
      (table_attribute
        (html_attribute
          (html_attribute_name)
          (html_attribute_value)))
      (tablecell
        (content
          (text))))))

=============================
Table with extra row starter
=============================

{|
|-
| Row 1 Cell 1
|-
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (tablerow
      (tablecell
        (content
          (text))))
    (tablerow)))

============================================
Table with extra row starter with attributes
============================================

{|
|-
| Row 1 Cell 1
|- class="highlight"
|}

--------------------------------------------------------------------------------

(source_file
  (table
    (tablerow
      (tablecell
        (content
          (text))))
    (tablerow
      (table_attribute
        (html_attribute
          (html_attribute_name)
          (html_attribute_value))))))

=======================================
Table with extra whitespace after close
=======================================

{|
|-
| Row 1 Cell 1
|} 

--------------------------------------------------------------------------------

(source_file
  (table
    (tablerow
      (tablecell
        (content
          (text)))))
  (ERROR))
