==================
Basic template
==================

{{Template}}

---

(source_file
  (paragraph
    (template
      (template_name
        (template_name_part)))))

==================
Template with unnamed parameters
==================

{{Template|parameter1|parameter2}}

---

(document
  (newline)
  (template
    (template_name)
    (template_parameter
      (param_name))
    (template_parameter
      (param_name)))
  (newline))

==================
Template with named parameters
==================

{{Template|name1=value1|name2=value2}}

---

(document
  (newline)
  (template
    (template_name)
    (template_parameter
      (param_name)
      (param_value))
    (template_parameter
      (param_name)
      (param_value)))
  (newline))

==================
Template with mixed parameters
==================

{{Template|first parameter|name=value}}

---

(document
  (newline)
  (template
    (template_name)
    (template_parameter
      (param_name))
    (template_parameter
      (param_name)
      (param_value)))
  (newline))

==================
Template with internal link in parameter name
==================

{{Template|parameter with [[Link|display text]]}}

---

(document
  (newline)
  (template
    (template_name)
    (template_parameter
      (param_name))
    (template_parameter
      (param_name)))
  (newline))

==================
Template with internal link in parameter value
==================

{{Template|pname=parameter with [[Link|display text]]}}

---

(document
  (newline)
  (template
    (template_name)
    (template_parameter
      (param_name)
      (param_value))
    (template_parameter
      (param_name)))
  (newline))

==================
Templates with complex content
==================

{{Template|This is text with '''bold''' and ''italic'' content}}

---

(document
  (newline)
  (template
    (template_name)
    (template_parameter
      (param_name)
      (bold
        content: (text))
      (text)
      (italic
        content: (text))
      (text))))

==================
Nested templates
==================

{{Outer|{{Inner|parameter}}}}

---

(document
  (template
    (template_name)
    (template_parameter)
    (MISSING "}}"))
  (template
    (template_name)
    (template_parameter
      (param_name)))
  (text)
  (newline))

==================
Templates in context
==================

Some text before {{Template|param}} and some text after.

---

(document
  (text)
  (template
    template_name: (text)
    template_parameter: (param_value
      (text)))
  (text)
  (newline))

==================
Multiple templates
==================

{{First|param1}}
{{Second|name=value}}

---

(document
  (template
    template_name: (text)
    template_parameter: (param_value
      (text)))
  (newline)
  (template
    template_name: (text)
    template_parameter: (param_name
      (text))
    (param_value
      (text))))
