==================
Basic template
==================

{{Template}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))))))

==================
Template with unnamed parameters
==================
{{Template|parameter1|parameter2}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_value
            (text)))
        (template_argument
          (template_param_value
            (text)))))))

==================
Template with named parameters
==================

{{Template|name1=value1|name2=value2}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))))))

==================
Template with mixed parameters
==================

{{Template|first parameter|name=value}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_value
            (text)))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))))))

==================
Template with internal link in parameter name
==================

{{Template|parameter with [[Link|display text]]}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_value
            (text)
            (wikilink
              (wikilink_page
                (page_name_segment))
              (page_name_segment))))))))

==================
Template with internal link in parameter value
==================

{{Template|pname=parameter with [[Link|display text]]}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)
            (wikilink
              (wikilink_page
                (page_name_segment))
              (page_name_segment))))))))

==================
Templates with complex content
==================

{{Template|This is text with '''bold''' and ''italic'' content}}

---------------------------------------------------

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_value
            (text)
            (bold
              (text))
            (text)
            (italic
              (text))
            (text)))))))

==================
Nested templates
==================

{{Outer|{{Inner|parameter}}}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_value
            (template
              (template_name
                (template_name_part))
              (template_argument
                (template_param_value
                  (text))))))))))

==================
Templates in context
==================

Some text before {{Template|param}} and some text after.

---

(source_file
  (section
    (paragraph
      (text)
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_value
            (text))))
      (text))))

==================
Multiple templates
==================

{{First|param1}}
{{Second|name=value}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_value
            (text)))))
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))))))

=====================================
Template with name having space in it
=====================================

{{Cite ref|url=someurl|title=some title|language=en}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))))))

=====================================
Template with values in new lines
=====================================

{{Cite ref
|url=someurl
|title=some title
|language=en
}}

---

(source_file
  (section
    (paragraph
      (template
        (template_name
          (template_name_part))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))
        (template_argument
          (template_param_name)
          (template_param_value
            (text)))))))
